BAS BMEKZU Project/src/Documents/ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом/ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом</name>
  <registerRecords>InformationRegister.ИНАГРО_ВзносыВФондыРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаРаботу</name>
    <comment>Сумма в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерОплаты</name>
    <type>
      <types>EnumRef.ИНАГРО_ХарактерВыплатыПоДоговору</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ИНАГРО_Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначитьВзносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзносаФОТ</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПрекращения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_ВидДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	КадровыйУчетФормы.ФормаКадровогоДокументаПриСозданииНаСервере(ЭтаФорма);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// Заполним реквизиты из значений заполнения
		Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда 
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
		Если Параметры.Свойство("Подразделение") И ЗначениеЗаполнено(Параметры.Подразделение) Тогда 
			Объект.Подразделение = Параметры.Подразделение;
		КонецЕсли;
		
		Если Параметры.Свойство("Сотрудник") И ЗначениеЗаполнено(Параметры.Сотрудник) Тогда 
			
			Объект.Организация = Параметры.Сотрудник.ГоловнаяОрганизация;
			Объект.Сотрудник = Параметры.Сотрудник;
			
		КонецЕсли;
		
		УстановитьФункциональныеОпцииФормы();
		УправлениеФормой(ЭтаФорма);
		
	КонецЕсли;		
		
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбщегоНазначенияБПКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	ПодготовитьФормуНаСервере(); 

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ОбработатьИзменениеСотрудникаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВзносыПриИзменении(Элемент)
		
	ВыполнитьНазначениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	УправлениеФормой(ЭтаФорма);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, Объект.Дата);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой(Форма)
	Форма.Элементы.ВидВзносаФОТ.Видимость 	= Объект.НазначитьВзносы;
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
// Процедура обрабатывает изменение сотрудника
Процедура ОбработатьИзменениеСотрудникаНаСервере()
	
	ЗаполнитьЗначенияСвойств(Объект,Объект.Сотрудник,"ФизическоеЛицо");
	Объект.ВидРасчета = ПланыВидовРасчета.ИНАГРО_Начисления.ОплатаПоДоговоруГПХ;
	
КонецПроцедуры // ОбработатьИзменениеСотрудника()

&НаСервере
// Процедура обрабатывает изменение сотрудника
Процедура ВыполнитьНазначениеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидВзносаФОТ) И НЕ Объект.НазначитьВзносы Тогда
		Объект.ВидВзносаФОТ = Справочники.Налоги.ПустаяСсылка();	
	КонецЕсли;	
	Если Объект.ВидВзносаФОТ = Справочники.Налоги.ПустаяСсылка() Тогда 
		Объект.ВидВзносаФОТ = Справочники.Налоги.ЕСВФОТГПХ;
	КонецЕсли;	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
